xml/lpa/google.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/Users/stephen/src/tsung-wrapper/config/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="protocol" version="1.0">
  <!-- Client Side Setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="9000"/>
  </clients>
  <!-- Server Side Setup -->
  <servers>
    <server host="test_server_host" port="80" type="tcp"/>
  </servers>
  <load>
    <!-- Scenario 1: Single User -->
    <arrivalphase phase="1" duration="6" unit="second">
      <users maxnumber="1" arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>
  <!-- Define User Agents -->
  <options>
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="full_run-20140424-143327" probability="100" type="ts_http">
      
      <!-- Hit Landing Page With Auto Key -->
      <request>
        <http url="https://www.google.com" version="1.1" method="GET"/>
      </request>
      
    </session>
  </sessions>
</tsung>