xml/lpa/minstage_hit_landing_page_only.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/Users/stephen/src/tsung-wrapper/config/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">
  <!-- Client Side Setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1500"/>
  </clients>
  <!-- Server Side Setup -->
  <servers>
    <server host="test_server_host" port="80" type="ssl"/>
  </servers>
  <load>
    <!-- Scenario 1: Minimal Load -->
    <arrivalphase phase="1" duration="20" unit="second">
      <users interarrival="5" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!-- Define User Agents -->
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="hit_landing_page_only-20140429-145117" probability="100" type="ts_http">
      <!-- Hit Landing Page -->
      <thinktime random="true" value="1"/>
      <request>
        <http url="https://staging-lpa.dsd.io/" version="1.1" method="GET"/>
      </request>
    </session>
  </sessions>
</tsung>